[
  {
    "name": "Caprese-style Portobello Mushrooms",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/09/caprese-portobello-mushrooms-25-scaled.jpg?resize=750%2C563&ssl=1",
    "description": "The fresh combination of tomatoes, mozzarella, and basil always feels like summer. These Caprese-Style Portobello Mushrooms capture that perfect flavor with the added bonus of warm, melty cheese. Light yet satisfying, they’re great on their own or paired with risotto or a green salad."
  },
  {
    "name": "Oatmeal with Quinoa and Chia Seeds",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/07/oatmeal-with-quinoa-9-scaled.jpg?resize=750%2C562&ssl=1",
    "description": "This Hot Cereal Mix with Oats, Quinoa, Chia Seeds, and Raisins is the perfect morning meal to kickstart your day with a delicious burst of energy."
  },
  {
    "name": "Italian Sausage, Peppers and Onions Sandwich",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/07/italian-sausage-onions-peppers-15H-scaled.jpg?resize=750%2C562&ssl=1",
    "description": "This healthier take on traditional Italian sausage uses ground turkey instead of pork, cutting saturated fat. We make the sausage ourselves, without fillers or preservatives, and control the salt content. Plus, each serving includes a generous amount of veggies cooked in olive oil for extra flavor and nutrition."
  },
  {
    "name": "Roasted Cauliflower Salad",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/06/roasted-cauliflower-salad-15-scaled.jpg?resize=750%2C563&ssl=1",
    "description": "This healthy cauliflower salad is not only tasty but also packed with nutrients. It can be enjoyed warm or at room temperature, making it a versatile addition to any meal."
  },
  {
    "name": "Salmon With Pesto and Garlic Tomatoes",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/05/salmon-with-pesto-garlic-tomatoes-13-scaled.jpg?resize=750%2C563&ssl=1",
    "description": "When work, family, and social life make weeknight dinners a challenge, this one-pan salmon with pesto and garlic tomatoes is a lifesaver. With simple prep, delicious flavor, and healthy ingredients, it’s a win for everyone at the table."
  },
  {
    "name": "Easy Sheet-Pan Chicken With Fennel And Olives",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/05/chicken-with-fennel-and-olives-12-scaled.jpg?resize=750%2C563&ssl=1",
    "description": "Juicy chicken thighs flavored with an aromatic spice blend, the delicate sweet flavor of fennel, olives, lemon juice and olive oil round up this Mediterranean delight! What better way to satisfy your hunger?"
  },
  {
    "name": "Pomegranate Glazed Salmon",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/03/pomegranate-glazed-salmon-12-scaled.jpg?resize=750%2C562&ssl=1",
    "description": "If you love the sweet-savory combo, our pomegranate glazed salmon is a must-try! Quick, easy, and nutritious, it’s the perfect healthy gourmet meal. Stick with us for more creative salmon recipes to keep your family happy and healthy!"
  },
  {
    "name": "Asparagus Salad with Wheat Berries",
    "url": "https://i0.wp.com/cuisinewithme.com/wp-content/uploads/2024/03/asparagus-salad-with-wheat-berries-12-scaled.jpg?resize=750%2C563&ssl=1",
    "description": "Spring is here, and what better way to celebrate than with a vibrant, fresh salad? This Asparagus Salad with Wheat Berries, Snap Peas, Cucumber, and Radishes combines seasonal flavors with hearty whole grains for a nutritious, flavorful dish."
  }
]
